Конфигурация_ServiceMP/src/InformationRegisters/ОчередьЕрЛог/ОчередьЕрЛог.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьЕрЛог</name>
  <attributes>
    <name>хрДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Лог</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>77</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ид</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Конфигурация_ServiceMP/src/InformationRegisters/ОчередьЕрЛог/ManagerModule.bsl
Процедура ErrorLogНаСервере() экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОчередьЕрЛог.ид КАК ид, хрДанные
	               |ИЗ
	               |	РегистрСведений.ОчередьЕрЛог КАК ОчередьЕрЛог";
	Тбл = Запрос.Выполнить().Выгрузить();
	
	Соединение = ПолучитьСоединение();
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	
	стрJSON = "";
	ном=0;
	Для а=1 по Тбл.Количество() Цикл
		Стр = ТБл[а-1];
		
		
		пСтк= Стр.хрДанные.Получить();
		Если типЗнч(пСтк)<>Тип("Структура") ТОгда Продолжить; КонецЕСлИ;
		Стк = Новый Структура("ДатаСобытия,ИмяКомпьютера,ИмяПользователя,ТипСобытия,Организация,СтрокаСоединенияИнформационнойБазы,ТекстОшибки,_sourse");
		ЗаполнитьЗначенияСвойств(Стк,пСтк);
		
		Для каждого Эл из Стк Цикл
			Если Эл.Ключ = "ДатаСобытия" Тогда 
				Стк.Вставить(Эл.Ключ,УниверсальноеВремя(эл.Значение));
			ИНаче
				Стк.Вставить(Эл.Ключ,СокрЛП(Эл.Значение));
			КонецЕсЛИ;
		КонецЦикла;
		//Стк.Вставить("_sourse",ЗначениеВСтрокуВнутр(Стк));
		
		
		Запись = Новый ЗаписьJSON;
		Запись.УстановитьСтроку();
		ЗаписатьJSON(Запись, Стк, НастройкиСериализации);
		стрJSON = стрJSON +"{ ""index"":{} }"+Символы.ПС+СтрЗаменить(Запись.Закрыть(),Символ(10),"")+Символы.ПС;
		
		ном=ном+1;
		Если ном = 500 или а=Тбл.Количество() тогда 
			Рез = ОтправитьвElastic(Соединение,стрJSON,"onecmp/_doc/_bulk/");
			Если Рез <> Истина ТОгда
				ЗаписьЖурналаРегистрации("Ошибка",,,"Ошибка выгрузки в elastic","Ошибка выгрузки в elastic");
			КонецЕСЛИ;
			стрJSON = "";
			ном=0;
		КонецЕсли;
		
		Зап = РегистрыСведений.ОчередьЕрЛог.СоздатьМенеджерЗаписи();
		Зап.ид = Стр.ид;
		Зап.Удалить();
		
	КонецЦиклА;
	
	
	
КонецПроцедуры


Функция ПолучитьСоединение()
	
	ssl = Новый ЗащищенноеСоединениеOpenSSL(
	Новый СертификатКлиентаWindows(),
	Новый СертификатыУдостоверяющихЦентровWindows());	
	
	//https://c2a93c2d0dfc4ad6acbb7ce0b83d6ecf.westeurope.azure.elastic-cloud.com:9243
	Соединение = Новый HTTPСоединение(
	"c2a93c2d0dfc4ad6acbb7ce0b83d6ecf.westeurope.azure.elastic-cloud.com",
	9243,
	"elastic",
	"2tYvqc3o7UJwoldRaNuJyLkC",
	,10
	,ssl
	);
	
	Возврат Соединение;
	
КонецФункции


Функция ОтправитьвElastic(Соединение,стрJSON,метод=Неопределено)  
	
	
	Если Метод=Неопределено Тогда
		  Метод = "onecjurreg/_doc/_bulk/";
	КонецеСЛИ;
	
	
	стрJSON = СтрЗаменить(стрJSON,Символ(13),"");
	
    //Запрос = Новый HTTPЗапрос("onecjurreg/_doc/");
    Запрос = Новый HTTPЗапрос(Метод);
	Запрос.Заголовки.Вставить("Content-Type", "application/x-ndjson");
	Запрос.УстановитьТелоИзСтроки(стрJSON);	
	
	Попытка
		Ответ = Соединение.Post(Запрос);
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	
	стк = новый структура();
	текЭл = Неопределено;
	Пока Чтение.Прочитать() Цикл
		Если Чтение.ТипТекущегоЗначения = ТипЗначенияJSON.ИмяСвойства Тогда
			текИмя = Чтение.ТекущееЗначение;
		ИНачеЕсли Чтение.ТипТекущегоЗначения = ТипЗначенияJSON.Булево
			или Чтение.ТипТекущегоЗначения = ТипЗначенияJSON.Строка
			или Чтение.ТипТекущегоЗначения = ТипЗначенияJSON.Число Тогда
			Если текИмя = Неопределено Тогда
				Стк.Вставить(Чтение.ТекущееЗначение);  
			ИНаче
				Стк.Вставить(текИмя,Чтение.ТекущееЗначение);  
			КонецЕСЛИ;
			текИмя = Неопределено;  
		Иначеесли текИмя<>Неопределено Тогда
			Стк.Вставить(текИмя);  
			текИмя = Неопределено;  
		КонецЕСЛИ;
	КонецЦиклА;
	
	Если Стк.Свойство("error") Тогда
		Сообщить(Ответ.ПолучитьТелоКакСтроку());
		Возврат ЛожЬ;
	КонецЕСЛи;
	
	Рез=Ложь;
	Если Стк.Свойство("errors",рез) Тогда
		Если Рез = Истина Тогда
			Сообщить(Ответ.ПолучитьТелоКакСтроку());
			Возврат ЛожЬ;
		КонецЕСЛИ;
	КонецЕСЛи;
	
	п = 0;
	Если Стк.Свойство("failed",п) Тогда
		Если п<>0 Тогда
			Сообщить(Ответ.ПолучитьТелоКакСтроку());
			Возврат ЛожЬ;
		КонецЕСЛИ;
	КонецЕсли;

	Возврат Истина;
	
КонецФункции
